In [1]:
import pandas as pd
import numpy as np

In [2]:
bas_url = "https://datasets.imdbws.com/title.basics.tsv.gz"

In [3]:
aka_url = "https://datasets.imdbws.com/title.akas.tsv.gz"

In [4]:
rat_url = "https://datasets.imdbws.com/title.ratings.tsv.gz"

In [5]:
bas = pd.read_csv(bas_url, sep='\t', low_memory=False)

In [6]:
aka = pd.read_csv(aka_url, sep='\t', low_memory=False)

In [7]:
rat = pd.read_csv(rat_url, sep='\t', low_memory=False)

In [8]:
bas = bas.replace({'\\N':np.nan})
bas.value_counts()

tconst      titleType     primaryTitle                  originalTitle                 isAdult  startYear  endYear  runtimeMinutes  genres
tt0025509   tvSeries      Les Misérables                Les misérables                0        1934       1934     279             Drama                    1
tt21962612  tvSeries      Teaterkrönika                 Teaterkrönika                 0        1974       1975     50              Documentary,Talk-Show    1
tt2196327   tvSeries      Candlepin Bowling             Candlepin Bowling             0        1958       1996     60              Sport                    1
tt2196329   tvSeries      Candlepins for Cash           Candlepins for Cash           0        1973       1982     60              Sport                    1
tt2196337   tvSeries      Championship 5-Pin Bowling    Championship 5-Pin Bowling    0        1984       2009     60              Sport                    1
                                                                                                                                                           ..
tt10286802  tvMiniSeries  REMINDERS                     REMINDERS                     0        2019       2019     31              Drama,Romance            1
tt10286956  tvSeries      Emotions Market               Talad Arom                    0        2011       2011     60              Drama,Romance            1
tt10287062  tvSeries      Speed                         Speed                         0        2019       2019     60              Documentary              1
tt10287236  tvSeries      Kohn Teun                     Kohn Teun                     0        2011       2011     45              Action,Crime,Drama       1
tt9916216   tvSeries      Kalyanam Mudhal Kadhal Varai  Kalyanam Mudhal Kadhal Varai  0        2014       2017     22              Romance                  1
Length: 46663, dtype: int64

In [9]:
aka = aka.replace({'\\N':np.nan})

In [10]:
rat = rat.replace({'\\N':np.nan})

In [11]:
bas.isna().sum()

tconst                  0
titleType               0
primaryTitle           11
originalTitle          11
isAdult                 1
startYear         1262577
endYear           9308891
runtimeMinutes    6769490
genres             431188
dtype: int64

In [12]:
bas.dropna(subset=['runtimeMinutes'], inplace = True)

In [13]:
bas.isna().sum()

tconst                  0
titleType               0
primaryTitle            1
originalTitle           1
isAdult                 1
startYear           99597
endYear           2590375
runtimeMinutes          0
genres              68981
dtype: int64

In [14]:
bas.dropna(subset=['genres'], inplace = True)

In [59]:
bas.isna().sum()

tconst                0
titleType             0
primaryTitle          0
originalTitle         0
isAdult               0
startYear             0
endYear           83827
runtimeMinutes        0
genres                0
dtype: int64

In [60]:
bas.duplicated().sum()

0

In [61]:
bas['titleType'].value_counts()

movie    83827
Name: titleType, dtype: int64

In [62]:
bas[bas['titleType'].str.contains
    ('tvEpisode|short|video|tvMovie|tvSeries|tvSpecial|tvMiniSeries|tvShort|videoGame')
    ==False]

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama
...,...,...,...,...,...,...,...,...,...
83822,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama
83823,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy"
83824,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama
83825,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller"
83826,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"

In [63]:
bas = bas[bas['titleType'].str.contains
    ('tvEpisode|short|video|tvMovie|tvSeries|tvSpecial|tvMiniSeries|tvShort|videoGame')
    ==False]

In [64]:
bas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 83827 entries, 0 to 83826
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          83827 non-null  object
 1   titleType       83827 non-null  object
 2   primaryTitle    83827 non-null  object
 3   originalTitle   83827 non-null  object
 4   isAdult         83827 non-null  int64
 5   startYear       83827 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  83827 non-null  int64
 8   genres          83827 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 6.4+ MB

In [65]:
bas['startYear'].value_counts()

2019    5747
2018    5651
2017    5537
2016    5160
2015    4941
2021    4939
2020    4891
2014    4810
2013    4660
2012    4450
2011    4165
2022    3793
2010    3788
2009    3476
2008    2853
2007    2497
2006    2361
2005    2141
2004    1848
2003    1643
2001    1535
2002    1522
2000    1419
Name: startYear, dtype: int64

In [66]:
bas.dropna(subset=['startYear'], inplace = True)

In [67]:
bas['startYear'] = bas['startYear'].astype(int)

In [68]:
bas = bas[bas['startYear'] >= 2000]

In [69]:
bas = bas[bas['startYear'] <= 2022]

In [70]:
bas['startYear'].value_counts()

2019    5747
2018    5651
2017    5537
2016    5160
2015    4941
2021    4939
2020    4891
2014    4810
2013    4660
2012    4450
2011    4165
2022    3793
2010    3788
2009    3476
2008    2853
2007    2497
2006    2361
2005    2141
2004    1848
2003    1643
2001    1535
2002    1522
2000    1419
Name: startYear, dtype: int64

In [71]:
bas['startYear'] = bas['startYear'].astype(object)

In [72]:
bas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 83827 entries, 0 to 83826
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          83827 non-null  object
 1   titleType       83827 non-null  object
 2   primaryTitle    83827 non-null  object
 3   originalTitle   83827 non-null  object
 4   isAdult         83827 non-null  int64
 5   startYear       83827 non-null  object
 6   endYear         0 non-null      float64
 7   runtimeMinutes  83827 non-null  int64
 8   genres          83827 non-null  object
dtypes: float64(1), int64(2), object(6)
memory usage: 6.4+ MB

In [73]:
is_documentary = bas['genres'].str.contains('documentary',case=False)

In [74]:
bas = bas[~is_documentary]

In [75]:
aka.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1380570 entries, 0 to 1380569
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1380570 non-null  object
 1   ordering         1380570 non-null  int64
 2   title            1380570 non-null  object
 3   region           1380570 non-null  object
 4   language         3741 non-null     object
 5   types            966982 non-null   object
 6   attributes       45397 non-null    object
 7   isOriginalTitle  1379195 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 84.3+ MB

In [76]:
aka.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [77]:
aka.duplicated().sum()

0

In [78]:
aka.isna().sum()

titleId                  0
ordering                 0
title                    0
region                   0
language           1376829
types               413588
attributes         1335173
isOriginalTitle       1375
dtype: int64

In [79]:
aka['region'].value_counts()

US    1380570
Name: region, dtype: int64

In [80]:
aka[aka['region'].str.contains('US') == True]

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0
...,...,...,...,...,...,...,...,...
1380565,tt9916702,1,Loving London: The Playground,US,NaN,NaN,NaN,0.0
1380566,tt9916720,10,The Demonic Nun,US,NaN,tv,NaN,0.0
1380567,tt9916720,12,The Nun 2,US,NaN,imdbDisplay,NaN,0.0
1380568,tt9916756,1,Pretty Pretty Black Girl,US,NaN,imdbDisplay,NaN,0.0
1380569,tt9916764,1,38,US,NaN,imdbDisplay,NaN,0.0

In [81]:
aka = aka[aka['region'].str.contains('US') == True]

In [82]:
aka['region'].value_counts()

US    1380570
Name: region, dtype: int64

In [83]:
aka.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [84]:
aka.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1380570 entries, 0 to 1380569
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1380570 non-null  object
 1   ordering         1380570 non-null  int64
 2   title            1380570 non-null  object
 3   region           1380570 non-null  object
 4   language         3741 non-null     object
 5   types            966982 non-null   object
 6   attributes       45397 non-null    object
 7   isOriginalTitle  1379195 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 94.8+ MB

In [85]:
keep = bas['tconst'].isin(aka['titleId'])
keep

0        True
1        True
2        True
3        True
4        True
         ...
83822    True
83823    True
83824    True
83825    True
83826    True
Name: tconst, Length: 83827, dtype: bool

In [86]:
bas = bas[keep]
bas.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [87]:
rat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 477282 entries, 0 to 477281
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         477282 non-null  object
 1   averageRating  477282 non-null  float64
 2   numVotes       477282 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 10.9+ MB

In [88]:
rat.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1924
1  tt0000002            5.8       260
2  tt0000005            6.2      2551
3  tt0000006            5.1       175
4  tt0000007            5.4       798

In [89]:
rat.duplicated().sum()

0

In [90]:
rat.isna().sum()

tconst           0
averageRating    0
numVotes         0
dtype: int64

In [91]:
keepII = rat['tconst'].isin(aka['titleId'])
keepII

0         True
1         True
2         True
3         True
4         True
          ...
477277    True
477278    True
477279    True
477280    True
477281    True
Name: tconst, Length: 477282, dtype: bool

In [92]:
rat = rat[keepII]
rat.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1924
1  tt0000002            5.8       260
2  tt0000005            6.2      2551
3  tt0000006            5.1       175
4  tt0000007            5.4       798

In [93]:
bas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 83827 entries, 0 to 83826
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          83827 non-null  object
 1   titleType       83827 non-null  object
 2   primaryTitle    83827 non-null  object
 3   originalTitle   83827 non-null  object
 4   isAdult         83827 non-null  int64
 5   startYear       83827 non-null  object
 6   endYear         0 non-null      float64
 7   runtimeMinutes  83827 non-null  int64
 8   genres          83827 non-null  object
dtypes: float64(1), int64(2), object(6)
memory usage: 6.4+ MB

In [94]:
aka.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1380570 entries, 0 to 1380569
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1380570 non-null  object
 1   ordering         1380570 non-null  int64
 2   title            1380570 non-null  object
 3   region           1380570 non-null  object
 4   language         3741 non-null     object
 5   types            966982 non-null   object
 6   attributes       45397 non-null    object
 7   isOriginalTitle  1379195 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 94.8+ MB

In [95]:
rat.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 477282 entries, 0 to 477281
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         477282 non-null  object
 1   averageRating  477282 non-null  float64
 2   numVotes       477282 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 14.6+ MB

In [96]:
import os
os.makedirs('Data/',exist_ok=True) 

os.listdir("Data/")

['.ipynb_checkpoints',
 'final_tmdb_data_2000.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 'title_akas.csv.gz',
 'title_basics.csv.gz',
 'title_ratings.csv.gz',
 'tmdb_api_results_2000.json',
 'tmdb_api_results_2001.json']

In [97]:
bas.to_csv("Data/title_basics.csv.gz",compression='gzip',index=False)

In [98]:
bas = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
bas.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [99]:
aka.to_csv("Data/title_akas.csv.gz",compression='gzip',index=False)

In [100]:
aka = pd.read_csv("Data/title_akas.csv.gz", low_memory = False)
aka.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [101]:
rat.to_csv("Data/title_ratings.csv.gz",compression='gzip',index=False)

In [102]:
rat = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
rat.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1924
1  tt0000002            5.8       260
2  tt0000005            6.2      2551
3  tt0000006            5.1       175
4  tt0000007            5.4       798